app/controllers/api/cons_controller.rb

  def show
    # debugger
    @con = Con.find(params[:id])
---
SELECT  "cons".* FROM "cons" WHERE "cons"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def index
    @cons = Con.all
---
SELECT "cons".* FROM "cons"