app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "age", "session_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create

    @user = User.new(user_params)
    if @user.save