app/models/user.rb

  def reset_session_token!
    self.update(session_token: self.class.generate_session_token)
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-04-09 01:32:07.679788"], ["session_token", "z1gbJoQJrBrytRStKeqt4Q"], ["id", 9]]